experiments/results/batches/6505451-two-policy-smoke/raw/adaptive-cold-cache-03-20260829T031337Z/k6.log
time="2026-08-29T03:13:42Z" level=warning msg="There were unknown fields in the options exported in the script" error="json: unknown field \"gracefulStop\""

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/hls.js
        output: json (/results/k6-metrics.jsonl)

     scenarios: (100.00%) 1 scenario, 5 max VUs, 48s max duration (incl. graceful stop):
              * default: Up to 5 looping VUs for 18s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 1/5 VUs, 4 complete and 0 interrupted iterations
default   [   6% ] 1/5 VUs  01.0s/18.0s

running (02.0s), 1/5 VUs, 9 complete and 0 interrupted iterations
default   [  11% ] 1/5 VUs  02.0s/18.0s

running (03.0s), 2/5 VUs, 18 complete and 0 interrupted iterations
default   [  17% ] 2/5 VUs  03.0s/18.0s

running (04.0s), 2/5 VUs, 28 complete and 0 interrupted iterations
default   [  22% ] 2/5 VUs  04.0s/18.0s

running (05.0s), 2/5 VUs, 37 complete and 0 interrupted iterations
default   [  28% ] 2/5 VUs  05.0s/18.0s

running (06.0s), 2/5 VUs, 47 complete and 0 interrupted iterations
default   [  33% ] 2/5 VUs  06.0s/18.0s

running (07.0s), 2/5 VUs, 57 complete and 0 interrupted iterations
default   [  39% ] 2/5 VUs  07.0s/18.0s

running (08.0s), 2/5 VUs, 67 complete and 0 interrupted iterations
default   [  44% ] 2/5 VUs  08.0s/18.0s

running (09.0s), 3/5 VUs, 74 complete and 0 interrupted iterations
default   [  50% ] 3/5 VUs  09.0s/18.0s

running (10.0s), 4/5 VUs, 92 complete and 0 interrupted iterations
default   [  56% ] 4/5 VUs  10.0s/18.0s

running (11.0s), 5/5 VUs, 116 complete and 0 interrupted iterations
default   [  61% ] 5/5 VUs  11.0s/18.0s

running (12.0s), 5/5 VUs, 139 complete and 0 interrupted iterations
default   [  67% ] 5/5 VUs  12.0s/18.0s

running (13.0s), 5/5 VUs, 153 complete and 0 interrupted iterations
default   [  72% ] 5/5 VUs  13.0s/18.0s

running (14.0s), 5/5 VUs, 175 complete and 0 interrupted iterations
default   [  78% ] 5/5 VUs  14.0s/18.0s

running (15.0s), 5/5 VUs, 193 complete and 0 interrupted iterations
default   [  83% ] 5/5 VUs  15.0s/18.0s

running (16.0s), 5/5 VUs, 218 complete and 0 interrupted iterations
default   [  89% ] 5/5 VUs  16.0s/18.0s

running (17.0s), 4/5 VUs, 233 complete and 0 interrupted iterations
default   [  94% ] 4/5 VUs  17.0s/18.0s

running (18.0s), 3/5 VUs, 251 complete and 0 interrupted iterations
default   [ 100% ] 3/5 VUs  18.0s/18.0s


  █ THRESHOLDS 

    hls_playlist_failures
    ✓ 'count>=0' count=0

    hls_segment_failures
    ✓ 'count>=0' count=0

    hls_session_failures
    ✓ 'rate>=0' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 762     42.005076/s
    checks_succeeded...: 100.00% 762 out of 762
    checks_failed......: 0.00%   0 out of 762

    ✓ master playlist is 200
    ✓ media playlist is 200
    ✓ segment is 200

    CUSTOM
    hls_playlist_failures..........: 0      0/s
    hls_playlist_requests..........: 508    28.003384/s
    hls_segment_duration...........: avg=24.57ms  min=654.29µs med=1.37ms   max=506.24ms p(90)=5.12ms   p(95)=70.19ms  p(99)=503.39ms
    hls_segment_failures...........: 0      0/s
    hls_segment_requests...........: 254    14.001692/s
    hls_session_failures...........: 0.00%  0 out of 254
    selected_edge_node.............: 762    42.005076/s

    HTTP
    http_req_duration..............: avg=9.03ms   min=129.09µs med=640.85µs max=506.24ms p(90)=2.97ms   p(95)=5.65ms   p(99)=502.06ms
      { expected_response:true }...: avg=9.03ms   min=129.09µs med=640.85µs max=506.24ms p(90)=2.97ms   p(95)=5.65ms   p(99)=502.06ms
    http_req_failed................: 0.00%  0 out of 775
    http_reqs......................: 775    42.721698/s

    EXECUTION
    iteration_duration.............: avg=230.34ms min=201.86ms med=204.3ms  max=816.48ms p(90)=214.79ms p(95)=291.46ms p(99)=776.23ms
    iterations.....................: 254    14.001692/s
    vus............................: 3      min=1        max=5
    vus_max........................: 5      min=5        max=5

    NETWORK
    data_received..................: 292 MB 16 MB/s
    data_sent......................: 158 kB 8.7 kB/s



running (18.1s), 0/5 VUs, 254 complete and 0 interrupted iterations
default ✓ [ 100% ] 0/5 VUs  18s